---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralType
source: html/0a0a3793-5fce-283d-4953-a137f5593db9.htm
---
# Autodesk.Revit.DB.Structure.StructuralType

Represents the structural type of a family instance.

## Syntax (C#)
```csharp
public enum StructuralType
```